app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request)
    {
        $request->validate([
            'first_name' => ['required', 'string', 'max:255'],
            'last_name'  => ['required', 'string', 'max:255'],
            'email'      => ['required', 'string', 'email', 'max:255', 'unique:users'],
            // 'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'first_name' => $request->first_name,
            'last_name'  => $request->last_name,
            'email'      => $request->email,
            'password'   => Hash::make($request->password),
        ]);
---
insert into `users` (`first_name`, `last_name`, `email`, `password`, `updated_at`, `created_at`) values ('Pacbay', 'Pacbay', 'guest@gmail.com', '$2y$10$bbHxkFYERUPjEOvG4bQ9f.8kwjBY01w18nucC4MChbGzG9cBnxMei', '2022-04-06 17:23:20', '2022-04-06 17:23:20')