app/Http/Controllers/AppraisalController.php

    public function index()
    {
        if (auth()->user()->user_type === 'admin') {
            $appraisals = Appraisal::all();

        } else {
            $id         = auth()->user()->id;
            $appraisals = Appraisal::where('order_by', $id)->get();

        }

        return view('appraisals.index')->with('appraisals', $appraisals);
---
select * from `appraisals`
select * from `appraisals` where `order_by` = 102

    public function externalcreate(Request $request)
    {
        $initial_order = Loan::where('TransDetailsLoan', $request->keyword)->first();
        if (is_null($initial_order)) {
            return "No Loan Found!";
        }
        if (strlen($initial_order->IntentToProceed) < 8) {
            return "The Borrower Intent to Proceed Date is Missing \n Please have your borrower complete the disclosure package.\n Or Contact your Lending Company\'s Disclosure Department.";
        }
        if ($initial_order->LoanType == "VA") {
            return "We are not able to order VA loans here at Express AMC. All VA appraisals MUST be ordered through VA Portal, \n Please contact your Loan Broker about it. Thanks";
        }
        return view('appraisals.externalcreate')->with('initial_order', $initial_order);
---
select * from `loans` where `TransDetailsLoan` = '1806021899' limit 1

    public function purchase(Request $request)
    {
        $appraisal     = Appraisal::find($request->id);
---
select * from `appraisals` where `appraisals`.`id` = '27' limit 1

    public function refund(Request $request)
    {
        // dd($request);
        $appraisal = Appraisal::find($request->appraisal_id);
        $user      = $request->user();
        $user->refund($appraisal->payment_id);
        $appraisal->payment = 'Refunded';
        $appraisal->save();
---
select * from `appraisals` where `appraisals`.`id` = '1' limit 1
update `appraisals` set `payment` = 'Refunded', `appraisals`.`updated_at` = '2022-04-06 17:41:44' where `id` = 1