app/Http/Controllers/GuestLoanController.php

    public function show($id)
    {
        $loan = Loan::where('TransDetailsLoan', $id)->first();
        return view('guest-loans.show')->with('loan', $loan);
---
select * from `loans` where `TransDetailsLoan` = '1807023151' limit 1
select * from `loans` where `TransDetailsLoan` = '1806021899' limit 1