app/Http/Controllers/GuestAppraisalController.php

select * from `appraisals` where `appraisals`.`id` = '25' limit 1
select * from `loans` where `TransDetailsLoan` = '1806021899' limit 1
---
    public function show($id)
    {
        $appraisal = Appraisal::find($id);
        $loan      = Loan::where('TransDetailsLoan', $appraisal->loan_number)->first();

select * from `users` where `users`.`id` = 102 limit 1
select * from `loans` where `TransDetailsLoan` = '1806021899' limit 1
---
    public function create(Request $request)
    {
        $user          = User::find(102);
        $initial_order = Loan::where('TransDetailsLoan', $request->loan_number)->first();

select * from `users` where `users`.`id` = 1 limit 1
select * from `appraisals` where `loan_number` = '1807023151' limit 1
select * from `loans` where `TransDetailsLoan` = '1805020715' limit 1
---
    public function externalcreate(Request $request)
    {
        $user          = User::find(102);
        $appraisal     = Appraisal::where('loan_number', $request->keyword)->first();
        $initial_order = Loan::where('TransDetailsLoan', $request->keyword)->first();

insert into `appraisals` (`loan_number`, `order_date`, `fee`, `order_by`, `updated_at`, `created_at`) values ('1807023151', '2022-04-06', '550', '102', '2022-04-06 23:05:47', '2022-04-06 23:05:47')
---
    public function store(Request $request)
    {
        $request->validate([
            'file'        => 'mimes:jpg,png,jpeg,pdf,txt,docx,doc|max:5048',
            'loan_number' => 'required|exists:loans,TransDetailsLoan',
            'order_date'  => 'required|date_format:Y-m-d',
            'fee'         => 'required|integer|min:0|max:2021',

        ]);

        Appraisal::create([
            'loan_number' => $request->input('loan_number'),
            'order_date'  => $request->input('order_date'),
            'fee'         => $request->input('fee'),
            'order_by'    => '102',
        ]);

select * from `users` where `users`.`id` = 102 limit 1
---
    public function payment($id)
    {
        $user   = User::find(102);

select * from `users` where `users`.`id` = 102 limit 1
select * from `appraisals` where `appraisals`.`id` = '25' limit 1
update `appraisals` set `payment` = 'Paid', `paid_by` = 'guest pasy', `payment_id` = 'pi_3Kli7KI8081xNGGp16ismAhS', `appraisals`.`updated_at` = '2022-04-06 23:18:27' where `id` = 25
---
    public function purchase(Request $request)
    {
        $user          = User::find(102);
        $appraisal     = Appraisal::find($request->id);
        $payer         = $request->input('card_holder_name');
        $paymentMethod = $request->input('payment_method');
        $amount        = $appraisal->fee;
        $user->createOrGetStripeCustomer();
        $user->updateDefaultPaymentMethod($paymentMethod);
        $payment               = $user->charge($amount, $request->payment_method, ['description' => $payer]);
        $appraisal->paid_by    = $payer;
        $appraisal->payment    = 'Paid';
        $appraisal->payment_id = $payment->id;
        $appraisal->save();