app/Http/Controllers/GuestAppraisalAddonController.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function payment($id)
    {
        dd($id);
        $user   = User::find(1);

select * from `users` where `users`.`id` = 1 limit 1
select * from `guest_appraisal_addons` where `guest_appraisal_addons`.`id` = '1' limit 1
update `guest_appraisal_addons` set `payment` = 'Paid', `paid_by` = '5235252', `payment_id` = 'pi_3Km4CuI8081xNGGp0b9IZqUd', `guest_appraisal_addons`.`updated_at` = '2022-04-07 22:53:42' where `id` = 1
---
    public function purchase(Request $request)
    {
        $user          = User::find(1);
        $appraisal     = GuestAppraisalAddon::find($request->id);
        $payer         = $request->input('card_holder_name');
        $paymentMethod = $request->input('payment_method');
        $amount        = $appraisal->fee;
        $user->createOrGetStripeCustomer();
        $user->updateDefaultPaymentMethod($paymentMethod);
        $payment               = $user->charge($amount, $request->payment_method, ['description' => $payer]);
        $appraisal->paid_by    = $payer;
        $appraisal->payment    = 'Paid';
        $appraisal->payment_id = $payment->id;
        $appraisal->save();

select * from `guest_appraisals` where `guest_appraisals`.`id` = '2' limit 1
insert into `guest_appraisal_addons` (`order_date`, `order_by`, `fee`, `guest_appraisal_id`, `loan_number`, `updated_at`, `created_at`) values ('2022-04-08', 'james.lee@pacbaylending.com', '150', '2', '1805020715', '2022-04-08 00:27:51', '2022-04-08 00:27:51')
---
    public function store(Request $request)
    {
        $loan_number = GuestAppraisal::find($request->input('guest_appraisal_id'))->loan_number;
        GuestAppraisalAddon::create([
            'order_date'         => $request->input('order_date'),
            'order_by'           => $request->input('order_by'),
            'fee'                => $request->input('fee'),
            'guest_appraisal_id' => $request->input('guest_appraisal_id'),
            'loan_number'        => $loan_number,
        ]);