app/Http/Controllers/GuestAppraisalController.php

    public function show($id)
    {
        $appraisal = GuestAppraisal::find($id);
---
select * from `guest_appraisals` where `guest_appraisals`.`id` = 'addon' limit 1

    public function externalcreate(Request $request)
    {
        // $user          = User::find(1);
        $appraisal = GuestAppraisal::where('loan_number', $request->keyword)->first();
        $loan      = GuestLoan::where('TransDetailsLoan', $request->keyword)->first();
---
select * from `guest_appraisals` where `loan_number` = '1805020715' limit 1
select * from `guest_loans` where `TransDetailsLoan` = '1806021899' limit 1

    public function store(Request $request)
    {

        // dd($request);
        $request->validate([
            'file'        => 'mimes:jpg,png,jpeg,pdf,txt,docx,doc|max:5048',
            'loan_number' => 'required|exists:guest_loans,TransDetailsLoan',
            'order_date'  => 'required|date_format:Y-m-d',
            'fee'         => 'required|integer|min:0|max:2021',
        ]);

        GuestAppraisal::create([
            'loan_number' => $request->input('loan_number'),
            'order_date'  => $request->input('order_date'),
            'fee'         => $request->input('fee'),
            'order_by'    => $request->input('order_by'),
            'company'     => $request->input('company'),
            'phone'       => $request->input('broker_phone'),
            'fax'         => $request->input('broker_fax'),
        ]);
---
insert into `guest_appraisals` (`loan_number`, `order_date`, `fee`, `order_by`, `company`, `phone`, `fax`, `updated_at`, `created_at`) values ('1806021899', '2022-04-08', '550', 'benjamin.j@pacbaylending.com', 'Pacbaylending', '1232931222', '1111', '2022-04-08 18:16:30', '2022-04-08 18:16:30')