app/Http/Controllers/LoanController.php

    public function index()
    {
        if (auth()->user()->user_type === 'admin') {
            $loans = Loan::all();
        } else {
            $user  = auth()->user()->id;
            $loans = Loan::where('created_by', $user)->get();
---
select * from `loans`
select * from `loans` where `created_by` = 101