app/Http/Controllers/UserController.php

    public function edit($id)
    {
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '1' limit 1